Revit 2027 API
IPointCloudAccess.GetColorEncoding Method
 Returns the encoding used by points in this point cloud.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
PointCloudColorEncoding GetColorEncoding()
Function GetColorEncoding As PointCloudColorEncoding
PointCloudColorEncoding GetColorEncoding()
abstract GetColorEncoding : unit -> PointCloudColorEncoding
Return Value
PointCloudColorEncoding
 The encoding.
See Also
Reference
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace